'''
пакет книги
Create - Read
Книга содержит:
издание - строка
автор - строка
название - строка
контент - массив (получаем из вне)

У книги должно быть оглавление(я создаю, оглавления не будет)
Мы должны воспользоваться оглавление
возможность переходить на оглавление(якоря)

В книге есть контент это может быть текст и изображение
текст и изображение может разсполагаться в произвольном порядке
мы должны уметь располагать в определенном порядке(заранее заданное)
(мы получаем порядок расположения)

Книги могут быть разного размера
количество строк в контенте и количество изображение(количество контента в зависимости от количества строк на странице)
'''
